{"<pad>": 0, "<unk>": 1, "<I>": 2, "function": 3, "f": 4, "{": 5, "local": 6, "@v1": 7, ":": 8, "int64": 9, "%t0": 10, "=": 11, "<num>": 12, "1": 13, "5": 14, "7": 15, "</num>": 16, "-": 17, "@p0": 18, "&": 19, "1099511627775": 20, "@v2": 21, "%t1": 22, ">=": 23, "6": 24, "3": 25, "branch_zero": 26, "->": 27, "L0": 28, "%t2": 29, "8": 30, "4": 31, "%t3": 32, "%t4": 33, "%t5": 34, "+": 35, "jump": 36, "L1": 37, "label": 38, "@v3": 39, "%t6": 40, "|": 41, "2": 42, "%t7": 43, "==": 44, "L2": 45, "%t8": 46, "%t9": 47, "/": 48, "%t10": 49, "%t11": 50, "L3": 51, "%t12": 52, "%t13": 53, "%t14": 54, "return": 55, "}": 56, "*": 57, "<-": 58, "0": 59, "@v4": 60, "@v5": 61, "9": 62, "^": 63, "@v6": 64, "!=": 65, "%t15": 66, "%t16": 67, "%t17": 68, "%t18": 69, "%t19": 70, "L4": 71, "%t20": 72, "%t21": 73, "L5": 74, "%t22": 75, "<=": 76, "@p2": 77, "<": 78, ">": 79, "@p1": 80, ">>": 81, "@v7": 82, "@v8": 83, "@v9": 84, "@v10": 85, "%": 86, "L6": 87, "%t23": 88, "%t24": 89, "L7": 90, "%t25": 91, "%t26": 92, "%t27": 93, "%t28": 94, "1099511627733": 95, "1099511627732": 96, "L8": 97, "L9": 98, "1099511627692": 99, "%t29": 100, "%t30": 101, "%t31": 102, "%t32": 103, "%t33": 104, "%t34": 105, "@v11": 106, "1099511627650": 107, "1099511627639": 108, "<<": 109, "1099511627559": 110, "1907505": 111, "L10": 112, "L11": 113, "%t35": 114, "%t36": 115, "1099511627703": 116, "1099511627762": 117, "1099511627669": 118, "1099511627756": 119, "1099511627760": 120, "1099511627634": 121, "1099511627568": 122, "1099511627571": 123, "1099511627716": 124, "1099511627694": 125, "1099511627636": 126, "1099511627575": 127, "1099511627714": 128, "1099511627746": 129, "678528": 130, "1099511627592": 131, "1099511627515": 132, "1099511627623": 133, "1099511627731": 134, "1099511627640": 135, "1099511627572": 136, "1099511627740": 137, "1099511627758": 138, "1099511627598": 139, "1099511627774": 140, "1099511627773": 141, "1099511627635": 142, "1099511627676": 143, "1099511627675": 144, "1099511627614": 145, "1099511627720": 146, "1099511627660": 147, "1099511627759": 148, "1099511627707": 149, "1099511627688": 150, "1099511627751": 151, "1099511627607": 152, "1099511627765": 153, "1099511627551": 154, "1099511627704": 155, "1099511627625": 156, "1099511627491": 157, "1099511627769": 158, "1099511627573": 159, "1099511627641": 160, "1099511627736": 161, "1099511627621": 162, "1099511627616": 163, "%t37": 164, "%t38": 165, "1099511627701": 166, "1099511627755": 167, "1099511627712": 168, "1099511627633": 169, "1099511627757": 170, "1099511627652": 171, "1099511627617": 172, "1099511627558": 173, "1099511627658": 174, "1099511627738": 175, "1099511627587": 176, "1099511627748": 177, "1099511627743": 178, "1099511627611": 179, "1099511627613": 180, "1099511627608": 181, "1099511627649": 182, "1099511627745": 183, "L12": 184, "%t39": 185, "L13": 186, "%t40": 187, "1099511627698": 188, "1099511627697": 189, "1099511627524": 190, "1099511627700": 191, "1099511627564": 192, "1099511627659": 193, "1099511627766": 194, "1099511627552": 195, "1099511627664": 196, "1099511614897": 197, "1099511627561": 198, "1099511627690": 199, "1099511627763": 200, "1099511627651": 201, "1099511627583": 202, "1099511627498": 203, "1099511627535": 204, "1099511627548": 205, "1099511627173": 206, "1099511627663": 207, "5028840": 208, "1099511627547": 209, "1099511627589": 210, "1099511627717": 211, "1099511609132": 212, "1099511627604": 213, "1099511627668": 214, "1099511627560": 215, "1099511627761": 216, "1099511627529": 217, "1099511627764": 218, "1099511627567": 219, "1099511627566": 220, "1099511627749": 221, "1099511627618": 222, "1099511627682": 223, "1099511627772": 224, "1099511627739": 225, "1099511627725": 226, "1099511627719": 227, "1099511627540": 228, "1099511627654": 229, "1099511627582": 230, "1099511627771": 231, "1099511627645": 232, "2119260": 233, "1099511627619": 234, "1099511627653": 235, "404200": 236, "1099511627767": 237, "1099511627638": 238}