{"<pad>": 0, "<bos>": 1, "<eos>": 2, "<unk>": 3, "function": 4, "main": 5, "{": 6, "\\n": 7, "label": 8, "L0": 9, "local": 10, "@acc": 11, ":": 12, "int64": 13, "<-": 14, "<num>": 15, "1": 16, "</num>": 17, "%t0": 18, "=": 19, "!=": 20, "9": 21, "4": 22, "6": 23, "branch_zero": 24, "->": 25, "L1": 26, "%t1": 27, "5": 28, "8": 29, "*": 30, "%t2": 31, "%t3": 32, "/": 33, "7": 34, "%t4": 35, "&": 36, "1099511627775": 37, "%t5": 38, "+": 39, "%t6": 40, "jump": 41, "L2": 42, "@v1": 43, "%t7": 44, "%t8": 45, "%t9": 46, "0": 47, "L3": 48, "%t10": 49, "3": 50, "^": 51, "%t11": 52, "%t12": 53, "%t13": 54, "%t14": 55, "L4": 56, "%t15": 57, "%t16": 58, "%t17": 59, "%t18": 60, "@v2": 61, "%t19": 62, "|": 63, "%t20": 64, "-": 65, "%t21": 66, ">>": 67, "%t22": 68, "%t23": 69, "%t24": 70, "%t25": 71, "@v3": 72, "%t26": 73, "2": 74, "%t27": 75, "@v4": 76, "%t28": 77, "%t29": 78, "%t30": 79, "%t31": 80, "%t32": 81, "%t33": 82, "%t34": 83, "%t35": 84, "%t36": 85, "%t37": 86, "%t38": 87, "%t39": 88, "%t40": 89, "L5": 90, "L6": 91, "return": 92, "}": 93, "1099511624518": 94, "==": 95, "%": 96, "@v5": 97, "%t41": 98, "1099511626418": 99, "<": 100, "@v6": 101, ">=": 102, "42204382": 103, "19312656": 104, "67903055": 105, ">": 106, "%t42": 107, "%t43": 108, "%t44": 109, "%t45": 110, "%t46": 111, "L7": 112, "L8": 113, "1099511627758": 114, "@v7": 115, "453065038533": 116, "1293985": 117, "@v8": 118, "30811444": 119, "<=": 120, "23598476": 121, "%t47": 122, "18510741": 123, "%t48": 124, "1099511626355": 125, "31895385": 126, "L9": 127, "L10": 128, "@v9": 129, "1099511627336": 130, "2827008": 131, "%t49": 132, "%t50": 133, "h0": 134, "@p0": 135, "(": 136, ")": 137, "@__inl_h0_0_local_v1": 138, "@__inl_h0_0_local_v2": 139, "@__inl_h0_0_local_v3": 140, "42876813": 141, "10217592": 142, "116689888476": 143, "1099511627121": 144, "9622375": 145, "13934178": 146, "2581270": 147, "25520812": 148, "1099493078884": 149, "@__inl_h0_0_param_p0": 150, "h1": 151, "@__inl_h1_0_local_v1": 152, "@__inl_h1_0_local_v2": 153, "10405088": 154, "L11": 155, "L12": 156, "1099511623324": 157, "22734195": 158, "41008611": 159, "302445": 160, "42712192": 161, "226689": 162, "1099511623772": 163, "1024896": 164, "@p1": 165, "@p2": 166, ",": 167, "@__inl_h0_0_param_p1": 168, "@__inl_h0_1_param_p1": 169, "@__inl_h0_1_local_v1": 170, "@__inl_h0_1_local_v2": 171, "@__inl_h0_1_local_v3": 172, "27673713": 173, "1099511627771": 174, "1099511625527": 175, "1099511622682": 176, "21859398": 177, "222161590": 178, "49392676": 179, "1099511624400": 180, "67612062": 181, "11359194": 182, "9279827": 183, "39129020": 184, "6730704": 185, "<<": 186, "62766822": 187, "1927830": 188, "10569852": 189, "1206240": 190, "23109484": 191, "1099511622846": 192, "4094739": 193, "397633": 194, "23966581": 195, "1099511621034": 196, "68661540": 197, "39730698": 198, "12602094": 199, "9001955": 200, "59405052": 201, "3660846": 202, "37259199": 203, "14281150": 204, "53362694": 205, "41280264": 206, "1099511627761": 207, "38696967": 208, "1099511624161": 209, "@__inl_h1_0_local_v3": 210, "@__inl_h0_1_param_p0": 211, "73111212": 212, "1099511622172": 213, "1910615": 214, "67408383": 215, "282813": 216, "1099511627253": 217, "2059372": 218, "1099511620788": 219}