{"<pad>": 0, "<bos>": 1, "<eos>": 2, "<unk>": 3, "function": 4, "main": 5, "{": 6, "\\n": 7, "label": 8, "L0": 9, "local": 10, "@acc": 11, ":": 12, "int64": 13, "<-": 14, "<num>": 15, "1": 16, "</num>": 17, "@v1": 18, "%t0": 19, "=": 20, "5": 21, "7": 22, "-": 23, "%t1": 24, "&": 25, "1099511627775": 26, "@v2": 27, "%t2": 28, "9": 29, "0": 30, "%t3": 31, "@v3": 32, "%t4": 33, "*": 34, "2": 35, "6": 36, "%t5": 37, "%t6": 38, "+": 39, "%t7": 40, "%t8": 41, "%t9": 42, "%t10": 43, "%t11": 44, "%t12": 45, "%t13": 46, "branch_zero": 47, "->": 48, "L1": 49, "jump": 50, "L2": 51, "return": 52, "}": 53, "|": 54, "4": 55, "^": 56, "3": 57, "<": 58, "@v4": 59, "%t14": 60, "%t15": 61, "%t16": 62, "%t17": 63, "%t18": 64, "%t19": 65, "%t20": 66, "%t21": 67, "%t22": 68, "%t23": 69, "L3": 70, "L4": 71, ">>": 72, "8": 73, "/": 74, "@v5": 75, "%": 76, "%t24": 77, "%t25": 78, "%t26": 79, "%t27": 80, "%t28": 81, ">": 82, "L5": 83, "L6": 84, ">=": 85, "==": 86, "@v6": 87, "%t29": 88, "%t30": 89, "%t31": 90, "%t32": 91, "%t33": 92, "%t34": 93, "%t35": 94, "1099511627668": 95, "L7": 96, "L8": 97, "<=": 98, "L9": 99, "L10": 100, "!=": 101, "1099511627703": 102, "h0": 103, "@p1": 104, "@p0": 105, "(": 106, ",": 107, ")": 108, "@__inl_h0_0_local_v1": 109, "@__inl_h0_0_local_v2": 110, "@__inl_h0_1_local_v1": 111, "@__inl_h0_1_local_v2": 112, "1099511627720": 113, "<<": 114, "@__inl_h0_0_param_p0": 115, "1099511627626": 116, "1099511627584": 117, "@p2": 118, "1099511627682": 119, "@__inl_h0_0_param_p2": 120, "1099511617825": 121, "1099511627723": 122, "1099511627747": 123, "1099511627523": 124, "1099511627754": 125, "%t36": 126, "864500": 127, "1099511627684": 128, "1099511627729": 129, "1099511627704": 130, "1099511627570": 131, "1099511627585": 132, "1099511627749": 133, "1099511627608": 134, "1099511627762": 135, "1099511627650": 136, "1099511627772": 137, "1099511627755": 138, "2524079": 139, "1099511627774": 140, "1099511627767": 141, "1099511627644": 142, "1099511627731": 143, "1099511627770": 144, "1099511627738": 145, "1099511627757": 146, "@__inl_h0_1_param_p0": 147, "1099511627690": 148, "@__inl_h0_0_param_p1": 149, "1099511627760": 150, "1099511627761": 151, "1099511627660": 152, "@__inl_h0_2_local_v1": 153, "@__inl_h0_2_local_v2": 154, "@__inl_h0_3_param_p0": 155, "@__inl_h0_3_local_v1": 156, "@__inl_h0_3_local_v2": 157, "1099511627773": 158, "1099511627614": 159, "@__inl_h0_1_param_p1": 160, "1099511627638": 161, "1099511627752": 162, "1099511627643": 163, "1099511623076": 164, "1099511627748": 165, "1099511627706": 166, "1099511627766": 167, "1099511627564": 168, "1099511627617": 169, "1099511627695": 170, "1099511627768": 171, "1099511627710": 172, "1099511627597": 173, "1099511627604": 174, "1099511627620": 175, "1099511627765": 176, "1099511627713": 177, "1099511627735": 178, "1099511627672": 179, "1099511627633": 180, "1099511627725": 181, "1099511627722": 182, "1099511627719": 183, "L11": 184, "L12": 185, "1099511627666": 186, "1099511627697": 187, "1099511627566": 188, "1099511627753": 189, "1099511627568": 190, "1099511627771": 191, "1099511627763": 192, "1099511627583": 193, "1099511627651": 194, "1099511627591": 195, "1099511627708": 196, "1099511627700": 197, "1099511627742": 198, "1099511627715": 199, "1099511627701": 200, "1099511627679": 201, "3388476": 202, "1099511627724": 203, "1099511627572": 204, "1099511623776": 205, "1099511627619": 206, "1099511627675": 207, "1099511627669": 208, "1099511627714": 209, "1099511627637": 210, "1099511591926": 211, "1099511627663": 212, "1099511627631": 213, "1099511627550": 214, "1099511627743": 215, "1099511627530": 216, "1099511627665": 217, "1099511627625": 218, "1099511627750": 219, "1099511627709": 220, "1099511627562": 221, "2928926": 222, "1099511627635": 223, "2053056": 224, "1099511627756": 225, "1099511627531": 226, "178794": 227, "2386070": 228, "__inl_h0_0_lbl_ir_while_1": 229, "__inl_h0_0_lbl_ir_while_end_2": 230, "723690": 231, "1099511627587": 232, "1099511627649": 233, "1099511627746": 234, "7044440": 235, "1099511627538": 236}